import next from 'next';

import type { NextPage } from 'next';

const Privacy: NextPage = () => {
  return (
    <div>
      <pre>
        {`Privacy Policy


내스타일메이트를 이용해 주셔서 감사합니다.

내스타일메이트 서비스의 개인정보취급방침은 다음과 같은 내용을 담고 있습니다.
내스타일메이트는 귀하의 개인정보 보호를 매우 중요하게 생각하며, 정보통신망이용촉진등에관한법률 등을 준수하고 있습니다. 회사는 개인정보보호방침을 통하여 귀하께서 제공하시는 개인정보가 어떠한 용도와 방식으로 이용되고 있으며 개인정보보호를 위해 어떠한 조치가 취해지고 있는지 알려드립니다.


1. 이용자 정보의 수집 및 목적

회사는 “이용자의 서비스 사용 분석 및 통계 분석을 통한 마케팅 자료로써 귀하의 취향에 맞는 최적의 서비스를 제공하기 위한 목적으로 귀하의 개인정보를 수집이용”하고 있습니다.

수집하는 이용자 정보는 다음과 같습니다.
1) 이용자의 사용 정보(개인식별이 불가능하도록 눈, 코, 입 등을 제거한 사진, 이용자의 서비스 사용 로그 등)
2) 장치 정보(OS 유형, 일련 번호, 하드웨어 정보 등) 브라우저 유형, 브라우저 언어 등

수집한 이용자 정보의 사용 목적은 다음과 같습니다.
1) 이용자에게 당사 서비스를 제공하기 위해
2) 당사 서비스의 제공과 연계하여 고객 서비스, 보안, 보관 및 백업 목적을 위해
3) 이용자에게 보다 나은 광고 및 직접 마케팅 경험을 제공하기 위해
4) 당사의 새 서비스를 개발하고 기존 서비스를 개선하기 위해

당사가 예외적으로 수집하는 정보는 위와 같이 그 자체로는 개인을 식별할 수 없는 형태이며, 당사는 수집된 정보를 바탕으로 개인을 식별하지 않습니다.

또한 이벤트 참여 등을 위해 이용자의 이메일 주소, 연락처(전화번호, 주소) 등을 수집할 수 있으며, 이러한 정보는 이벤트 당첨자 및 우수 이용자에게 상품을 배송하기 위함으로 사용 목적 이외에는 활용하거나 저장하지 않습니다.


2. 목적 외 사용 및 제3자에 대한 제공 및 공유

회사는 귀하의 동의가 있거나 관련법령의 규정에 의한 경우를 제외하고는 어떠한 경우에도 개인정보의 수집목적 및 이용목적에서 고지한 범위를 넘어 귀하의 개인정보를 이용하거나 타인 또는 타기업, 기관에 제공하지 않습니다.


3. 개인정보의 파기

수집한 이용자 정보는 수집 및 이용목적이 달성되면 지체없이 파기하며, 절차 및 방법은 다음과 같습니다. 전자적 파일 형태인 경우 복구 및 재생되지 않도록 안전하게 삭제하고, 그 밖에 기록물, 인쇄물 등의 경우 분쇄하거나 소각하여 파기합니다.



4. 개인정보관리담당자

귀하의 개인정보를 보호하고 개인정보와 관련한 불만을 처리하기 위하여 회사는 개인정보관리담당자를 두고 있습니다. 개인정보와 관련한 문의사항이 있으시면 아래의 개인정보관리담당자에게 연락주시기 바랍니다. 귀하의 문의사항에 신속하고 성실하게 답변해드리겠습니다.



[개인정보관리 담당자]
 이름 : 장준호
 소속 : 내스타일메이트
 e-mail : nestylemate@gmail.com


5. 쿠키에 의한 개인정보 수집

회사는 귀하의 정보를 수시로 저장하고 찾아내는 ‘쿠키(cookie)’를 운용합니다. 쿠키란 웹사이트를 운영하는데 이용되는 서버가 귀하의 브라우저에 보내는 아주 작은 텍스트 파일로서 귀하의 컴퓨터 하드디스크에 저장됩니다.

회사는 다음과 같은 목적을 위해 쿠키를 사용합니다.

- 이용자의 접속 빈도나 방문 시간 등을 분석하고 이용자의 취향과 관심분야를 파악하여 타겟(target) 마케팅 및 서비스 개편 등의 척도로 활용합니다.

- 이용한 항목들에 대한 정보와 관심 있게 둘러본 항목들에 대한 자취를 추적하여 다음 번 이용 때 개인 맞춤 서비스를 제공하는 데 이용합니다.

- 회사에서 진행하는 각종 이벤트에서 귀하의 참여 정도 및 방문 회수를 파악하여 차별적인 응모 기회를 부여하고 개인의 관심 분야에 따라 차별화된 정보를 제공하기 위한 자료로 이용됩니다.

단, 이용자가 웹 브라우저의 쿠키 사용을 허용하지 않았을 경우에는 회사에서 제공하는 다양한 서비스를 받으실 수 없습니다.


6. 개인정보 보호를 위한 노력 및 이용자의 권리

이용자(이용자가 14세 미만인 경우 이용자의 법정대리인)는 당사에 저장되어 있는 이용자의 서비스 이용 결과 및 기타 수집된 정보를 언제든지 조회, 수정, 정정 또는 삭제를 요청할 수 있습니다. 이용자는 홈페이지 아래에 있는 ‘계정정보 삭제’ 란을 통해 편리하게 개인정보 삭제 요청을 하실 수 있습니다.

당사는 보유 정보의 안전성 확보를 위해 다음과 같은 기술적∙관리적 대책을 강구하고 있습니다.

당사는 보유하고 있는 정보들에 대한 안전성 확보를 위하여 다음과 같은 기술적/관리적 대책을 강구하고 있습니다.
- 당사는 백신프로그램을 이용하여 컴퓨터바이러스에 의한 피해를 방지하기 위한 조치를 취하고 있습니다. 백신프로그램은 주기적으로 업데이트되며 악성프로그램관련 경보가 발령되거나 보안 업데이트 공지가 있는 경우 즉시 이를 적용함으로써 정보가 침해되는 것을 방지하고 있습니다.
- 당사는 내부관리계획을 마련하여 소속 직원으로 하여금 이를 숙지하고 준수하도록 하고 있습니다.
- 당사는 정보를 취급할 수 있는 자를 최소한으로 제한하고 있습니다.
- 정보보호정책에 대한 이행사항 및 준수여부를 점검하기 위한 내부절차를 마련하여 지속적으로 시행하고 있습니다


7. 정책 변경에 따른 공지의무

이 개인정보보호방침은 2021년 8월 1일에 개정 되었으며 법령 및 정책 또는 보안기술의 변경에 따라 내용의 추가 및 삭제, 수정이 있을 시에는 변경되는 개인정보보호정책을 시행하기 최소 10일전에 어플리케이션 공지사항을 통해 변경이유 및 내용 등을 공지하도록 하겠습니다.`}
      </pre>
    </div>
  );
};

export default Privacy;
